[
  {
    "title": "Valentines Day",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "Range Rover",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "#RISERCONCERTD2",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "Culver",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "#SmackDown",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "#Adrenaline3rdWin",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "SWAT",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "Bronwyn",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "#FromMintoWithLove",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "Tubi",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "#DragRace",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "UNLV",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "Hampton",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "Tory",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "Sami",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "Reid Hoffman",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "Bitboy",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "Baird Greene",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "Rupert",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "North Carolina A&T",
    "score": 2.5,
    "sources": [
      "twitter"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "/r/WorldNews Live Thread: Russian Invasion of Ukraine Day 1451, Part 1 (Thread #1598)",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "π Rendered by PID 117605 on reddit-service-r2-loggedout-867999b997-vh4xs at 2026-02-14 09:53:07.811081+00:00 running cd9c813 country code: IN.",
    "summary": "π Rendered by PID 117605 on reddit-service-r2-loggedout-867999b997-vh4xs at 2026-02-14 09:53:07.811081+00:00 running cd9c813 country code: IN...."
  },
  {
    "title": "Russia confirms $12 trillion pitch to Trump tied to Ukraine deal",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "Russia appeared to confirm on Feb. 13 the existence of a sweeping U.S.-Russia economic proposal known in Kyiv as the \"Dmitriev package,\" days after President Volodymyr Zelensky first disclosed it publicly.\n\nThe Ukrainian president said on Feb. 6 that intelligence had briefed him on what he described as a roughly $12 trillion framework for large-scale economic cooperation between Moscow and Washington.\n\n\"Intelligence showed me the so-called 'Dmitriev package' that he presented in the U.S. — it amounts to around $12 trillion,\" Zelensky told reporters in Kyiv.\n\nThe reference is to Kirill Dmitriev, an envoy who heads Russia's sovereign wealth fund and has remained engaged with top U.S. officials, including Special Envoy Steve Witkoff.\n\nThe White House twice declined to confirm the existence of such proposals in comments to the Kyiv Independent — first after Zelensky's disclosure and again following a subsequent Bloomberg reporting.\n\nThe Russian acknowledgment marks the first official signal that such proposals are on the table as the U.S. pushes for a deal to end Russia's war against Ukraine.\n\nWhat's inside?\n\nThat Bloomberg reporting offered a detailed look at what Russia may be seeking.\n\nThe outlet reported on Feb. 12 that Russia seeks to secure a wide-ranging economic partnership with the U.S. as part of an arrangement tied to Ukraine.\n\nCiting an internal Russian memo prepared earlier this year, the outlet said Moscow wants relief from restrictions that have cut it off from the dollar payment system.\n\nRussia reportedly views the restoration of dollar-based settlements as part of a potential peace deal. The memo outlines seven areas of possible U.S.-Russia cooperation.\n\nBeyond regaining access to dollar transactions, Moscow reportedly seeks long-term contracts for American aircraft to modernize Russia's commercial fleet, as well as joint ventures in hard-to-recover oil extraction and liquefied natural gas production.\n\nThe Kremlin has long sought the lifting of U.S. sanctions on its aviation sector.\n\nThe proposals also include cooperation in nuclear energy, and expanded mining projects for lithium, copper, nickel, and platinum.\n\nTo sweeten the offer, the Kremlin signals it is ready to factor in previous American investments in Russia and contribute to compensation for losses incurred after Western companies exited the market following the start of Moscow's all-out war.\n\nU.S. firms would receive preferential treatment if they return to Russia's market.\n\nThe plan also envisions joint efforts to promote fossil fuels globally as an alternative to the so-called \"green\" climate-focused policies.\n\nMoscow's careful confirmation\n\nWhen asked about the package on Feb. 13, Kremlin spokesperson Dmitry Peskov didn't deny its existence. He framed it as a natural extension of shared economic interests.\n\n\"This Bloomberg article explains something that is quite obvious,\" Peskov said. \"Of course, we are offering cooperation. Of course, companies from both countries are potentially interested in this cooperation — so there you have joint ventures.\"\n\nRussia has not refused to use dollars — it was the United States that imposed restrictions on the use of the currency, he added.\n\nHis response marked Moscow's first public acknowledgment that economic cooperation proposals are under discussion with Washington — a significant shift given the White House's refusal to confirm such talks.\n\nThe dollar gambit\n\nAmong the proposals, Russia's push to return to dollar-based settlements stands out as the most politically sensitive — and hypocritical.\n\nRussian President Vladimir Putin has repeatedly argued that the dollar's global dominance is declining and accused the U.S. of \"parasitizing\" the world economy.\n\nPutin has also predicted that U.S. sanctions policy against Moscow would ultimately undermine the dollar's role in global finance.\n\nA renewed embrace of dollar transactions would mark a reversal from the Kremlin's recent policy of \"de-dollarization,\" as Moscow's officials have called it.\n\nSince 2022, Russia has expanded settlements in national currencies with partners such as India and China and promoted alternatives within the BRICS group.\n\nAlthough Putin said in October 2024 that there were no immediate plans to create a single BRICS currency, he noted the bloc's pursuit of financial sovereignty.\n\nThat effort has earlier drawn a warning from the Trump administration.\n\nIn January 2025, U.S. President Donald Trump threatened to impose 100% tariffs on BRICS members if they attempt to adopt a new or existing currency to replace the U.S. dollar in international trade.\n\nUkraine as bargaining chip\n\nTaken together, the reported \"Dmitriev package\" suggests that Moscow is linking any movement on Ukraine not only to territorial and political demands, but also to a sweeping reset of economic relations with the United States.\n\nRussia sees the war in Ukraine as leverage for extracting massive economic concessions from Washington, while trying to push its maximalist demands for Kyiv.",
    "summary": "Russia appeared to confirm on Feb. 13 the existence of a sweeping U.S.-Russia economic proposal known in Kyiv as the \"Dmitriev package,\" days after President Volodymyr Zelensky first disclosed it publicly.\n\nThe Ukrainian president said on Feb. 6 that intelligence had briefed him on what he described as a roughly $12 trillion framework for large-scale economic cooperation between Moscow and Washington.\n\n\"Intelligence showed me the so-called 'Dmitriev package' that he presented in the U.S. — it am..."
  },
  {
    "title": "US military preparing for potentially weeks-long Iran operations",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "Iran TV reporter says 'Death to Ali Khamenei' live",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "An Iranian broadcast reporter appeared to say \"death to Khamenei\" on live television on Wednesday.\n\nDuring a live broadcast commemorating the anniversary of the Islamic Revolution, reporter Musab Rasoulizad was present at one of the rallies, describing the turnout.\n\nHe then said “Marg bar Khamenei” (death to Khamenei) in his sign-off, instead of one of the chants typically heard at one of the regime-backed rallies, such as \"death to Israel\" or \"death to America.\"\n\nNotably, the chant was widely used in recent anti-regime protests.\n\nLater, Rasoulizad posted a video apologizing for the incident, calling it a “slip of the tongue and a blunder which was broadcast and became a pretext for anti-revolutionaries,\" according to the Saudi state-owned Al Arabiya.\n\nA paratrooper descends with an Iranian flag near Azadi Tower during the 47th anniversary of the Islamic Revolution in Tehran, Iran February 11, 2026 (credit: MAJID ASGARIPOUR/WANA (WEST ASIA NEWS AGENCY) VIA REUTERS)\n\nIranian journalist says \"death to Khamenei\" on live television\n\nAfter the incident, Iran's state broadcaster said that it had dismissed the provincial broadcast station's director and had summoned several others for disciplinary review.\n\n“The broadcast director of the Hamoun provincial TV channel has been dismissed following an error that occurred on the provincial network,” Al Arabiya quoted Iran's state television authority as saying on Wednesday. “The transmission operator and broadcast supervisor were suspended. Other staff found at fault were also referred to the disciplinary committee.”\n\nMosque plays 'death to Khamenei' over loudspeaker on Islamic Revolution anniversary\n\nAlso on Wednesday, social media footage showed a mosque sermon in which a speaker nearly uttered the same phrase.\n\nIn the video, after the speaker chants \"death to America,\" the phrase \"Marg bar Khamen-\" can be heard before cutting off.\n\nOn Wednesday, Iran marked 47 years since the Islamic Revolution with rallies across the country and speeches from leaders.\n\nSupreme Leader Ali Khamenei claimed that Iran's enemies, who were \"seeking the surrender of the Iranian nation,\" were frustrated by the supposed turnout of the rallies.\n\n\"Dear Iranian nation. By God’s grace, you carried out this great feat yesterday, and Almighty God shall reward the nation for such a presence and such a monumental movement. That reward will be greater honor, authority, and independence, God willing,\" he wrote in a post on X/Twitter.\n\nAt one anniversary event, Iranian President Masoud Pezeshkian claimed the Islamic regime felt “great sorrow” over the recent crackdown on protesters during a Wednesday speech for the 47th anniversary of the Islamic Revolution.\n\n“We are ashamed before the people. We are obliged to serve all those who were harmed in this process. We are ready to hear the voice of the people. We are servants of the people, and we do not seek to confront the people,” he said.\n\nHe also claimed that the regime was ready to “hear the voice of the people.”\n\nHowever, according to the report, Pezeshkian failed to address the protestors' claims, only focusing on the methods used by the Islamic Republic to silence them and in delivering a “unifying message.”\n\nInternational human rights groups reported that the regime's crackdown claimed over 30,000 victims. However, the Islamic Regime has claimed that only 5,000 people died in the scuffles.",
    "summary": "An Iranian broadcast reporter appeared to say \"death to Khamenei\" on live television on Wednesday.\n\nDuring a live broadcast commemorating the anniversary of the Islamic Revolution, reporter Musab Rasoulizad was present at one of the rallies, describing the turnout.\n\nHe then said “Marg bar Khamenei” (death to Khamenei) in his sign-off, instead of one of the chants typically heard at one of the regime-backed rallies, such as \"death to Israel\" or \"death to America.\"\n\nNotably, the chant was widely u..."
  },
  {
    "title": "Father of Indian student killed by cop dies just before $29 million settlement",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "The family of Jaahnavi Kandula, a 23-year-old Indian student killed in a U.S. police crash a few years ago, suffered a second devastating blow after her father passed away just two days before the announcement of a $29 million compensation deal.\n\nJaahnavi’s life was cut short on January 23, 2023, when she was knocked down by a speeding Seattle police vehicle while she was crossing the street. The officer involved was responding to an emergency call at that time.\n\nA relative of Jaahnavi told PTI that Kandula Srikanth, a retired police constable, died of a heart attack on February 10 here in Kurnool district.\n\n“His (Srikanth’s) last rites were performed on Wednesday (February 11, 2026) in Adoni, as the family grappled with yet another devastating loss,” said the relative on Friday (February 13).\n\nHe further said the family is currently mourning, and it was not appropriate to speak about the settlement money.\n\nJaahnavi was a Master’s student in Information Systems at the Seattle campus of Northeastern University.",
    "summary": "The family of Jaahnavi Kandula, a 23-year-old Indian student killed in a U.S. police crash a few years ago, suffered a second devastating blow after her father passed away just two days before the announcement of a $29 million compensation deal.\n\nJaahnavi’s life was cut short on January 23, 2023, when she was knocked down by a speeding Seattle police vehicle while she was crossing the street. The officer involved was responding to an emergency call at that time.\n\nA relative of Jaahnavi told PTI ..."
  },
  {
    "title": "Ukrainian Forces Destroy British Brigade in NATO Wargame",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "Russia’s war against Ukraine has already reshaped global military thinking, but the WSJ reported that a major NATO drill last May revealed how unprepared Western forces remain for high-intensity combat dominated by drones and real-time battlefield intelligence, according to a report by The Wall Street Journal on February 12.\n\nThe exercise, called Hedgehog 2025, brought together more than 16,000 troops from 12 NATO countries alongside Ukrainian drone specialists, including personnel temporarily drawn from the front. The scenario simulated a “contested and congested” battlefield saturated with unmanned systems.\n\nWe bring you stories from the ground. Your support keeps our team in the field. DONATE NOW\n\nThe overall outcome for NATO forces was “horrible,” he added, saying the opposing side was “able to eliminate two battalions in a day,” leaving units effectively unable to continue fighting.\n\n“The aim was really to create friction, the stress for units, and the cognitive overload as soon as possible,” said Lt. Col. Arbo Probal of the Estonian Defence Forces, describing the intent to test how quickly soldiers could adapt under pressure.\n\nAccording to the WSJ, one simulated offensive involving thousands of troops—including a British brigade and an Estonian division—quickly revealed a critical flaw. Advancing forces failed to account for the extreme visibility created by drones.\n\nThe NATO battle group was “just walking around, not using any kind of disguise, parking tents and armored vehicles,” one participant recalled. “It was all destroyed.”\n\nUkrainian teams relied on Delta, a battlefield-management system that gathers real-time intelligence, applies artificial intelligence to analyze data, identifies targets, and coordinates strikes across units. The system enables a rapid kill chain—spotting, sharing, and striking targets within minutes.\n\nA small Ukrainian-led adversary group of roughly ten personnel carried out a counterattack that mock-destroyed 17 armored vehicles and conducted 30 simulated strikes in about half a day, the WSJ reported.\n\nAnother opposing unit led by Estonian unmanned-systems coordinator Aivar Hanniotti deployed more than 30 drones across an area smaller than four square miles. Even with fewer drones than typically seen on Ukraine’s real front lines, concealment proved nearly impossible.\n\n“There was no possibility to hide,” Hanniotti said. “We quite easily found cars and mechanized units, and we were able to take them out quite fast with strike drones.”\n\nWSJ reporting noted that the drill shocked participating officers and highlighted how Ukraine’s combat experience is reshaping European security thinking. Estonian officials said exercises like Hedgehog demonstrate the limits of learning from videos or reports alone.\n\nThe exercise also underscored broader structural challenges—from slow strike coordination to restricted data sharing inside NATO—that contrast with Ukraine’s faster, more networked battlefield approach.\n\n“Lessons are not learned when they are identified,” said retired Gen. David Petraeus. “Rather, they are only learned when you develop new concepts, write new doctrine, change organizational structures, overhaul your training, refine leader development courses, set out new materiel requirements that drive the procurement process, and even make changes to your personnel policies, recruiting, and facilities.”\n\nDespite Estonia’s efforts to adapt training, doctrine, and defense investment for the drone era, Ukrainian experts warn that many NATO members still misunderstand the realities of modern war. Maria Lemberg of the Ukrainian nonprofit Aerorozvidka said some armies continue training soldiers using outdated doctrines not suited to today’s battlefield.\n\nOne commander who observed the exercise concluded: “We are f—.”\n\nAsked about that reaction, Probal said the goal was to force participants to think critically and avoid complacency. From his perspective, he said, “mission accomplished.”\n\nEarlier, Representatives of the NATO-Ukraine Joint Analysis, Training, and Education Centre (JATEC) participated in the Red Hyena 45 strategic war game in the United Kingdom, contributing Ukrainian battlefield experience to inform elements of NATO’s long-term policy toward Russia.",
    "summary": "Russia’s war against Ukraine has already reshaped global military thinking, but the WSJ reported that a major NATO drill last May revealed how unprepared Western forces remain for high-intensity combat dominated by drones and real-time battlefield intelligence, according to a report by The Wall Street Journal on February 12.\n\nThe exercise, called Hedgehog 2025, brought together more than 16,000 troops from 12 NATO countries alongside Ukrainian drone specialists, including personnel temporarily d..."
  },
  {
    "title": "German Chancellor Merz says US leadership ‘lost,’ calls for repair of relations",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "Iranian TV journalist signs off live broadcast saying 'death to Khamenei' in 'tongue-slip'",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "Powered by Yahoo Scout. Yahoo is using AI to generate key points from this article. This means the info may not always match what’s in the article. Reporting mistakes helps us improve the experience.\n\nKey takeaways Powered by Yahoo Scout. Yahoo is using AI to generate key points from this article. This means the info may not always match what’s in the article. Reporting mistakes helps us improve the experience.\n\nA TV reporter signed off on a live broadcast with “Marg bar Khamenei” (death to Khamenei) instead of one of the chants typically heard at one of the regime-backed rallies, such as \"death to Israel.\"\n\nAn Iranian broadcast reporter appeared to say \"death to Khamenei\" on live television on Wednesday.\n\nDuring a live broadcast commemorating the anniversary of the Islamic Revolution, reporter Musab Rasoulizad was present at one of the rallies, describing the turnout.\n\nAdvertisement Advertisement\n\nHe then said “Marg bar Khamenei” (death to Khamenei) in his sign-off, instead of one of the chants typically heard at one of the regime-backed rallies, such as \"death to Israel\" or \"death to America.\"\n\nNotably, the chant was widely used in recent anti-regime protests.\n\nLater, Rasoulizad posted a video apologizing for the incident, calling it a “slip of the tongue and a blunder which was broadcast and became a pretext for anti-revolutionaries,\" according to the Saudi state-owned Al Arabiya.\n\nA paratrooper descends with an Iranian flag near Azadi Tower during the 47th anniversary of the Islamic Revolution in Tehran, Iran February 11, 2026 (credit: MAJID ASGARIPOUR/WANA (WEST ASIA NEWS AGENCY) VIA REUTERS)\n\nIranian journalist says \"death to Khamenei\" on live television\n\nAfter the incident, Iran's state broadcaster said that it had dismissed the provincial broadcast station's director and had summoned several others for disciplinary review.\n\nAdvertisement Advertisement\n\n“The broadcast director of the Hamoun provincial TV channel has been dismissed following an error that occurred on the provincial network,” Al Arabiya quoted Iran's state television authority as saying on Wednesday. “The transmission operator and broadcast supervisor were suspended. Other staff found at fault were also referred to the disciplinary committee.”\n\nMosque plays 'death to Khamenei' over loudspeaker on Islamic Revolution anniversary\n\nAlso on Wednesday, social media footage showed a mosque sermon in which a speaker nearly uttered the same phrase.\n\nIn the video, after the speaker chants \"death to America,\" the phrase \"Marg bar Khamen-\" can be heard before cutting off.\n\nOn Wednesday, Iran marked 47 years since the Islamic Revolution with rallies across the country and speeches from leaders.\n\nAdvertisement Advertisement\n\nSupreme Leader Ali Khamenei claimed that Iran's enemies, who were \"seeking the surrender of the Iranian nation,\" were frustrated by the supposed turnout of the rallies.\n\n\"Dear Iranian nation. By God’s grace, you carried out this great feat yesterday, and Almighty God shall reward the nation for such a presence and such a monumental movement. That reward will be greater honor, authority, and independence, God willing,\" he wrote in a post on X/Twitter.\n\nAt one anniversary event, Iranian President Masoud Pezeshkian claimed the Islamic regime felt “great sorrow” over the recent crackdown on protesters during a Wednesday speech for the 47th anniversary of the Islamic Revolution.\n\n“We are ashamed before the people. We are obliged to serve all those who were harmed in this process. We are ready to hear the voice of the people. We are servants of the people, and we do not seek to confront the people,” he said.\n\nAdvertisement Advertisement\n\nHe also claimed that the regime was ready to “hear the voice of the people.”\n\nHowever, according to the report, Pezeshkian failed to address the protestors' claims, only focusing on the methods used by the Islamic Republic to silence them and in delivering a “unifying message.”\n\nInternational human rights groups reported that the regime's crackdown claimed over 30,000 victims. However, the Islamic Regime has claimed that only 5,000 people died in the scuffles.\n\nTobias Holcman contributed to this report.",
    "summary": "Powered by Yahoo Scout. Yahoo is using AI to generate key points from this article. This means the info may not always match what’s in the article. Reporting mistakes helps us improve the experience.\n\nKey takeaways Powered by Yahoo Scout. Yahoo is using AI to generate key points from this article. This means the info may not always match what’s in the article. Reporting mistakes helps us improve the experience.\n\nA TV reporter signed off on a live broadcast with “Marg bar Khamenei” (death to Kham..."
  },
  {
    "title": "Ukraine Says Russian Troops Paid for Fake Starlink, Doxxed Themselves - Business Insider",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "A recent block aimed at cutting off Russian Starlink access has prompted a slew of reports that the Kremlin's soldiers are approaching Ukrainians for help registering their terminals.\n\nA recent block aimed at cutting off Russian Starlink access has prompted a slew of reports that the Kremlin's soldiers are approaching Ukrainians for help registering their terminals. Serhii Korovayny/Global Images Ukraine via Getty Images\n\nA recent block aimed at cutting off Russian Starlink access has prompted a slew of reports that the Kremlin's soldiers are approaching Ukrainians for help registering their terminals. Serhii Korovayny/Global Images Ukraine via Getty Images\n\nlighning bolt icon An icon in the shape of a lightning bolt.\n\nlighning bolt icon An icon in the shape of a lightning bolt. Impact Link\n\nA Ukrainian cyberwarfare division said on Thursday that it created a fake Starlink registration service to trick Russian soldiers into giving up sensitive data.\n\nThe 256th Cyber Assault Division said it partnered with open-source intelligence groups to promote a network of Telegram channels and bots that offered to help the Kremlin's troops register Starlink terminals on a Ukrainian whitelist.\n\nBut the channels were a ruse, and had instead been run by Ukrainian forces, who were sent location and terminal data from the soldiers, the 256th said.\n\nIts statement is yet another example of how wartime operations have spilled into social media, and comes after repeated reports that Russian forces have been trying to circumvent a region-wide Starlink block by paying Ukrainian civilians to register terminals for them.\n\nSpaceX cut off connectivity in Ukraine earlier this month, allowing only terminals logged with the Ukrainian government to continue receiving service. The sweeping move was enacted after repeated reports that Russian forces were buying terminals on the black market to guide attack drones and run battlefield communications.\n\nRussia downplayed the impact of the geofenced block on its operations, but Kyiv officials say that attempts by the Kremlin's troops to register terminals indicate their need for the American-run service.\n\nIn its statement, the 256th said it leveraged those needs to connect with the Russian soldiers.\n\n\"Understanding how desperately this mold would look for ways to restore Elon Musk's dish network — and the threats this poses — we, together with InformNapalm and MILITANT, decided to 'help' them,\" the division wrote, citing the two groups it worked with.\n\nAccording to screenshots posted by the division, which appear to show interactions with Russian troops, the Telegram bots would ask the soldiers for information about their Starlink terminals.\n\nThe soldiers then appear to share details such as their terminal ID numbers, satellite dish numbers, Starlink account numbers, and their location coordinates in latitude and longitude.\n\nBusiness Insider could not independently verify the authenticity of these screenshots.\n\nThe 256th said it collected 2,420 data entries on Russian Starlink terminals and their \"precise\" locations, as well as $5,870 from Moscow's troops paying for the faux service.\n\nThe division added that 31 Ukrainians had approached its network asking for opportunities to help Russians register terminals.\n\nInformNapalm, a Ukrainian-European OSINT group, said in a statement that it played a \"supporting role\" in the operation by pretending to complain about Telegram channels that were supposedly aiding Russians with Starlink registration.\n\nOn Monday, the group had posted about a channel named \"russian_starlink,\" which it wrote was surging in popularity but had still not been blocked by Ukrainian authorities.\n\n\"That was already one of the stages of drawing Russian military personnel even deeper into the 'honeypot,'\" the group wrote of the Monday post.\n\nMILITANT, a Ukrainian OSINT group that shared InformNapalm's Monday post, called the initiative \"Operation Self-Liquidation.\"\n\n\"As for the coordinates they sent, packages were sent back. 155s,\" the group wrote, referencing 155mm artillery shells.\n\nThe 256th said it sent the Russian data entries to Serhii Sternenko, an advisor on drone logistics and technology for Ukraine's defense ministry. A spokesperson for Sternenko's foundation did not immediately respond to a request for comment outside regular business hours.\n\nIn a separate statement on X, InformNapalm said that the deception's \"intended effect has been achieved,\" indicating that the operation has concluded.",
    "summary": "A recent block aimed at cutting off Russian Starlink access has prompted a slew of reports that the Kremlin's soldiers are approaching Ukrainians for help registering their terminals.\n\nA recent block aimed at cutting off Russian Starlink access has prompted a slew of reports that the Kremlin's soldiers are approaching Ukrainians for help registering their terminals. Serhii Korovayny/Global Images Ukraine via Getty Images\n\nA recent block aimed at cutting off Russian Starlink access has prompted a..."
  },
  {
    "title": "Poland Decriminalizes Service in Ukrainian Armed Forces",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "Poland’s lower house of parliament, the Sejm, has passed a bill granting legal protection to Polish citizens who fought on Ukraine’s side in the war against Russia, Polish outlet PolskieRadio24 reported on February 13.\n\nThe legislation, approved by an overwhelming majority, exempts volunteers from criminal liability for serving in the Ukrainian military without prior authorization from Poland’s Ministry of National Defense. Under previously existing Polish law, such service was punishable by three months to five years in prison.\n\nWe bring you stories from the ground. Your support keeps our team in the field. DONATE NOW\n\nThe vote was nearly unanimous. A total of 406 MPs supported the bill, 19 abstained, and four voted against it, including members of Grzegorz Braun’s Confederation of the Polish Crown and one Law and Justice (PiS) deputy. Support came across the political spectrum, including Law and Justice, the Civic Coalition, the Polish People’s Party, Poland 2050, and smaller groupings, PolskieRadio24 wrote.\n\nThe bill introduces an amnesty not only for those currently fighting in Ukraine but also for individuals already convicted under the previous rules. It also covers cases involving recruitment of Polish citizens or residents into the Armed Forces of Ukraine.\n\nAccording to the proposed provisions, the amnesty period is retroactive, beginning on April 6, 2014, when fighting erupted in Ukraine’s Lyhansk and Donetsk regions following Russia’s intervention. The legislation will now move to the Senate for further consideration.\n\nPolskieRadio24 noted that the exact number of Poles who have fought or continue to fight alongside Ukraine remains unclear.\n\nEarlier, a Polish man who traveled to Ukraine in 2023 to verify reports of Russia’s invasion was allegedly tortured to death in a Russian detention facility.\n\nThe individual, identified as Krzysztof Galos from Kraków, reportedly crossed into Ukraine in mid-April 2023. According to reports, he was skeptical of news coverage about the war and decided to investigate the situation personally.",
    "summary": "Poland’s lower house of parliament, the Sejm, has passed a bill granting legal protection to Polish citizens who fought on Ukraine’s side in the war against Russia, Polish outlet PolskieRadio24 reported on February 13.\n\nThe legislation, approved by an overwhelming majority, exempts volunteers from criminal liability for serving in the Ukrainian military without prior authorization from Poland’s Ministry of National Defense. Under previously existing Polish law, such service was punishable by thr..."
  },
  {
    "title": "Britain Rushes 1,000 Supersonic Missiles to Shield Ukraine From Russian Strikes",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "The United Kingdom will supply Ukraine with 1,000 additional multi-purpose air defense missiles, as Western allies move to reinforce Kyiv’s protection against continued Russian aerial attacks, according to the British Ministry of Defence announced on February 12.\n\nThe weapons in question are Lightweight Multirole Missiles (LMMs) manufactured in Belfast.\n\nWe bring you stories from the ground. Your support keeps our team in the field. DONATE NOW\n\nEach missile weighs about 13 kilograms, can engage targets at ranges exceeding six kilometers, and travels at roughly 1.5 times the speed of sound, making it well-suited for countering drones and other airborne threats.\n\nBritish Defence Secretary John Healey also confirmed that London will allocate about $681.4 million to strengthen Ukraine’s air defense capabilities as part of a broader emergency support package.\n\n“The UK is ironclad in our commitment to Ukraine,” the ministry said.\n\nThe UK is set to deliver an additional 1,000 Lightweight Multirole Missiles, manufactured in Belfast, that will be critical to defending Ukrainian infrastructure and cities from Russia’s escalating drone and missile attacks.\n\n\n\nThe UK is ironclad in our commitment to Ukraine. pic.twitter.com/BuoKkMrkkG — Ministry of Defence 🇬🇧 (@DefenceHQ) February 12, 2026\n\nThe wider air defense initiative exceeds $680 million in total value and includes approximately $204 million directed to NATO’s Prioritised Ukraine Requirements List (PURL) mechanism, which accelerates the delivery of interceptor missiles to protect Ukrainian skies.\n\nAnother portion of the package—worth roughly $530 million—supports deeper industrial cooperation between the United Kingdom and Ukraine, including the transfer of production and maintenance capabilities for Rapid Ranger launchers and associated command-and-control vehicles.\n\nIn the coming months, London is also expected to provide 1,200 additional air defense missiles and 200,000 rounds of artillery ammunition through the multinational Air Defence Consortium, further expanding support for Ukraine’s frontline defenses.\n\n“As we approach the fifth year of Putin’s full-scale invasion, the UK and our allies are more committed than ever to supporting Ukraine,” Healey said.\n\n“I’m proud of the UK’s continued leadership and pleased to confirm a new half-billion-pound air defense package to help Ukrainians defend against relentless drone and missile attacks.”\n\nThe announcement coincided with the 33rd meeting of the Ukraine Defence Contact Group at NATO headquarters in Brussels, co-chaired by the United Kingdom and Germany and attended by senior officials, including Ukraine’s Defense Minister and NATO leadership.\n\nParticipants focused on Ukraine’s military requirements for 2026, battlefield lessons, and future equipment deliveries needed to sustain resistance against Russia’s ongoing war.\n\nEarlier, the UK Ministry of Defence officially confirmed that 13 Raven short-range air defense systems have already been delivered to Ukraine, along with two prototype Gravehawk systems.",
    "summary": "The United Kingdom will supply Ukraine with 1,000 additional multi-purpose air defense missiles, as Western allies move to reinforce Kyiv’s protection against continued Russian aerial attacks, according to the British Ministry of Defence announced on February 12.\n\nThe weapons in question are Lightweight Multirole Missiles (LMMs) manufactured in Belfast.\n\nWe bring you stories from the ground. Your support keeps our team in the field. DONATE NOW\n\nEach missile weighs about 13 kilograms, can engage ..."
  },
  {
    "title": "Canada, Denmark deepen defence ties after Greenland annexation threat",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "The audio version of this article is generated by AI-based technology. Mispronunciations can occur. We are working with our partners to continually review and improve the results.\n\nCanada and Denmark signed a defence co-operation agreement on the sidelines of the Munich Security Conference, setting the stage for a deeper partnership after the Trump administration threatened to annex Greenland.\n\nThe agreement was signed by Defence Minister David McGuinty on Friday.\n\nOriginally Prime Minister Mark Carney was supposed to be present and have a one-on-one session with his Danish counterpart, Mette Frederiksen. But Carney opted to remain in Canada following the school shooting in Tumbler Ridge, B.C.\n\nDenmark has sought to bolster the defences of Greenland, a semi-autonomous territory, in light of the annexation threats of the United States. In tandem, NATO this week launched what's being called the Arctic Sentry initiative, which will co-ordinate military exercises and the alliance's response to threats in the region.\n\n\"Canada is an Arctic nation — and we will defend the North,\" McGuinty said in a statement following the signing in the southern German city.\n\n\"Today, this defence co-operation agreement with Denmark, Greenland and the Faroe Islands strengthens our collective deterrence and our ability to operate seamlessly with our NATO partners in the High North. Today, we send a clear message — the Arctic is secure, and we will keep it that way.\"\n\nThe co-operation agreement is not a formal treaty and doesn't commit Canada to defending Danish sovereignty over and above the commitments that already exist under NATO's Article 5, that an attack on one is an attack on all.\n\nWATCH | Why does Trump want Greenland? What's with Trump’s obsession with Greenland? | About That | Duration 12:38 U.S. president-elect Donald Trump has long been fascinated with owning and controlling Greenland, spanning from his interest in buying the country in 2019, to his recent refusal to rule out taking it by military force. Andrew Chang explores four potential reasons why Trump calls ownership of Greenland 'an absolute necessity.' Images provided by Getty Images, Reuters and The Canadian Press.\n\nSenior federal officials, speaking on background at a technical briefing this week, said the new agreement captures and improves upon many of the aspects of defence co-operation that already exist between Canada and Denmark.\n\nFor example, Denmark contributes a significant number of troops to the Canadian-led NATO multinational brigade defending Latvia. Separately, the Danish defence acquisition ministry is a big customer for Canadian-made assault rifles, signing last September a multimillion-dollar contract for 26,000 C-8 MRR (modular rail rifle) carbines.\n\nThe agreement signed Friday increases co-operation in the areas of surveillance and joint operations, the Danish Ministry of Defence said.\n\nSenior Canadian officials, who spoke earlier in the week in a briefing intended to set up the prime minister's trip, said negotiations toward the agreement predate U.S. President Donald Trump's drive to annex Greenland.\n\n\"The text of the agreement has not changed\" as a result of the increased tensions over Greenland, said one senior official.\n\nTrump has long had an interest in asserting U.S. \"ownership and control\" over the Arctic island, saying it was an \"absolute necessity\" for national security.\n\nThe U.S. administration reportedly ordered plans for a \"possible invasion,\" prompting Denmark and eight NATO allies to deploy defensive forces to the Arctic island.\n\nTrump went into the World Economic Forum in Davos, Switzerland, restating his demands. But hours after a speech at the forum, Trump met with NATO Secretary General Mark Rutte and later announced he would not use force to take the island and there's a framework of a deal to meet U.S. security concerns.\n\nAlthough no details have been released, published reports suggest the agreement centres on updating the 1951 Greenland Defense Agreement to grant the United States \"total access\" and \"infinite\" security rights in Greenland and possibly sovereign control over specific \"pockets\" where U.S. bases are located — similar to the British Sovereign Base Areas in Cyprus or the U.S. Guantanamo Bay lease in Cuba.\n\nThe political hangover of the fight is still being felt in Munich where French President Emmanuel Macron spoke Friday about Europe becoming more assertive.\n\n\"If we want to be taken seriously on the European continent and beyond, we must show the world our unwavering commitment to defend our own interests,\" Macron said, following up with a reference to disagreement over Greenland.\n\n\"It starts, of course, with continuing to extend our support to Ukraine, but it could nicely follow with fanning off unjustified tariffs and politely declining unjustified claims on European territory.\"",
    "summary": "The audio version of this article is generated by AI-based technology. Mispronunciations can occur. We are working with our partners to continually review and improve the results.\n\nCanada and Denmark signed a defence co-operation agreement on the sidelines of the Munich Security Conference, setting the stage for a deeper partnership after the Trump administration threatened to annex Greenland.\n\nThe agreement was signed by Defence Minister David McGuinty on Friday.\n\nOriginally Prime Minister Mark..."
  },
  {
    "title": "German defence minister warns Russia cannot sustain war in Ukraine economically for long",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "German Defence Minister Boris Pistorius has said there are signs that Russia will not be able to economically sustain its war against Ukraine for much longer.\n\nSource: European Pravda, citing an interview with ntv\n\nDetails: \"It would be very surprising if Russia were able to maintain this for a very, very long time.\"\n\nAdvertisement:\n\n\"We need to stop the flow of money from gas and oil sales as quickly, completely and decisively as possible, because this is the funding source for this terrible war – the funds that Russia needs,\" he added.\n\nPreviously: French President Emmanuel Macron recently noted that sending troops to Ukraine at this stage would risk escalation and a loss of control over the situation.\n\n\"I believe our main priority in the coming weeks should be to restore cooperation with the US so that together we recognise there is no room for short-term negotiations. Additional sanctions and measures against the shadow fleet should be imposed and pressure on the Russian economy increased to stop this war, but under much more favourable conditions,\" Macron explained.\n\nBackground: German Chancellor Friedrich Merz urged the US to reject isolationist ideas and work with Europe on global challenges.\n\nSupport Ukrainska Pravda on Patreon!",
    "summary": "German Defence Minister Boris Pistorius has said there are signs that Russia will not be able to economically sustain its war against Ukraine for much longer.\n\nSource: European Pravda, citing an interview with ntv\n\nDetails: \"It would be very surprising if Russia were able to maintain this for a very, very long time.\"\n\nAdvertisement:\n\n\"We need to stop the flow of money from gas and oil sales as quickly, completely and decisively as possible, because this is the funding source for this terrible wa..."
  },
  {
    "title": "UK must move away from US and towards a 'more European NATO', Starmer to say at defence summit",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "US ‘not powerful enough to go it alone’, Merz tells Munich conference",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "The US acting alone has reached the limits of its power and may already have lost its role as global leader, Friedrich Merz, the German chancellor, warned Donald Trump at the opening of the Munich Security Conference.\n\nMerz also disclosed he had held initial talks with the French president, Emmanuel Macron, over the possibility of joining France’s nuclear umbrella, underlining his call for Europe to develop a stronger self-standing security strategy.\n\nIn a speech on Friday designed to set a firm yet conciliatory tone about the future of the transatlantic partnership, Merz argued the old order had ended and in this new age of superpowers even the US was reaching the limits of going it alone.\n\nReferring to those that warned the international rules-based order was about to be destroyed, Merz said: “I fear we must put it even more bluntly. This order, however imperfect it was even at its best, no longer exists in that form.”\n\nSwitching to English to ram home his message, Merz said: “In the era of great power rivalry, even the United States will not be powerful enough to go it alone. Dear friends, being a part of Nato is not only Europe’s competitive advantage. It is also the United States’ competitive advantage.”\n\n“So let’s repair and revive transatlantic trust together,” he added.\n\nThe German chancellor’s speech opened the annual gathering of top global security figures including many European leaders and the US secretary of state, Marco Rubio.\n\nAt last year’s conference, held a few weeks into Trump’s second term, the US vice-president, JD Vance, stunned European leaders by lecturing them about the state of democracy and freedom of speech on the continent – a moment that set the tone for the last year.\n\nView image in fullscreen The US secretary of state, Marco Rubio, met Friedrich Merz at a bilateral meeting on the sidelines of the conference. Photograph: Liesa Johannssen/AFP/Getty\n\nA series of statements and moves from the Trump administration targeting allies has followed, including Trump’s threat last month to impose new tariffs on several European countries in a move to secure US control of Greenland, a semi-autonomous territory of Denmark, a Nato ally.\n\nMerz drew most applause from an audience brimming with hostility toward US unilateralism when he directly criticised the current American administration, saying: “The culture war of the Maga movement is not ours. Freedom of speech ends here with us when that speech is directed against human dignity and the basic law. We do not believe in tariffs and protectionism, but in free trade. We stand by climate agreements and the World Health Organization.”\n\n“In the age of great powers, our freedom is no longer a given. It is threatened,” he said, adding that “firmness and willpower will be needed to assert this freedom”. Challenging Trump’s unilateral style, Merz added: “Autocracies may have followers, democracies have partners and allies.”\n\n2:06 Munich Security Conference 2026: where does the US-EU relationship stand? – video\n\nAt the same time, he said Europe must cast off its excessive dependence on the US, emphasising: “We won’t do that by writing off Nato.”\n\nHe also urged the US president to recognise it was still possible to exhaust Russia economically and militarily, to the point where it was willing to come to the negotiating table over Ukraine.\n\nWith Germany one of the European countries doing the most to boost its own defence spending, Merz clearly felt in a strong enough position to insist the US needed to do more to listen to European concerns about its security and the legitimacy of a sustained European pillar of Nato.\n\nDescribing the Munich conference as a seismograph for the state of US-European relations, he said the Ukraine war “had forced Europe to return from a vacation from world history. Together we have entered an era that is once again marked by power and big-power politics.”\n\nThese big powers, Merz said, “make their own rules. It is fast, harsh and often unpredictable. These powers exploit natural resources, technologies and supply chains using them as bargaining tools.”\n\nMerz was speaking as the fourth anniversary of the Russian invasion of Ukraine approaches and one year after Vance used his speech in the same hall to criticise Europeans for not taking enough control of their own defence arrangements and ignoring the demands of their electorates.\n\nMerz responded by saying it was crucial for the continent to change its mindset and fully exploit the “enormous” military, political, economic and technological potential of a “sovereign Europe”. Germany was striving for “partnership-based leadership” in Europe but retained no “hegemonic fantasies”.\n\nView image in fullscreen The French president, Emmanuel Macron, arrives at the conference in Munich. Photograph: Thomas Kienzle/AP\n\nMerz said he had begun talks with Macron about a European nuclear deterrent. This, he said, must be firmly integrated into Nato’s nuclear arsenal and would not result in some parts of Europe being more defended than others. The chancellor stated that Germany was not abandoning Nato but wanted to establish a “strong, self-sustaining pillar” within the alliance.\n\nIn his speech Macron insisted Europe must be at the table to negotiate a new arms control settlement with Russia covering ballistic missiles, deep strike capacity, defence technology and nuclear weapons.\n\nThe French president said previous arms control treaties such as the now defunct INF Treaty were negotiated only by the US and this could not be repeated if Europe was to be taken seriously as a geopolitical power.\n\nHe said initial talks about new European security architecture had already been held with the UK and Germany, but it was now time to broaden the consultations across Europe.\n\n0:53 Emmanuel Macron: Time for Europe to become geopolitical power – video\n\nMacron warned a Ukrainian peace settlement required applying extra pressure, but even if an agreement was reached Europe faced the challenge of how to “coexist with an unreconstructed aggressive Russia on our borders” that has “a bloated army and a defence industry on a sugar high”.\n\nCalling for a transparent independent European channel of communication with Russia, he said the post second world war security architecture had been “totally designed and framed during the cold war times” and needed a new articulation.\n\nAddressing the criticisms directed at Europe last year by Vance, Macron said “Europe has been vilified … as a repressive continent where speech is not free and where alternative facts cannot claim the same right of citizenship as truth itself – that outdated and cumbersome concept.”",
    "summary": "The US acting alone has reached the limits of its power and may already have lost its role as global leader, Friedrich Merz, the German chancellor, warned Donald Trump at the opening of the Munich Security Conference.\n\nMerz also disclosed he had held initial talks with the French president, Emmanuel Macron, over the possibility of joining France’s nuclear umbrella, underlining his call for Europe to develop a stronger self-standing security strategy.\n\nIn a speech on Friday designed to set a firm..."
  },
  {
    "title": "Time for Europe to become geopolitical power, France's Macron says",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "",
    "summary": ""
  },
  {
    "title": "Armed with 'supermajority,' PM Takaichi eyes revising Japan's constitution",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "TOKYO -- Newly empowered with a two-thirds majority in the lower house of parliament, the government of Japanese Prime Minister Sanae Takaichi is set to restart discussions about amending the Japanese Constitution.",
    "summary": "TOKYO -- Newly empowered with a two-thirds majority in the lower house of parliament, the government of Japanese Prime Minister Sanae Takaichi is set to restart discussions about amending the Japanese Constitution...."
  },
  {
    "title": "WHO slams US-funded newborn vaccine trial as \"unethical\"",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "The World Health Organization on Friday released a formal statement blasting a US-funded vaccine trial as “unethical,” because it would withhold an established, safe, and potentially lifesaving vaccine against hepatitis B from some newborns in Guinea-Bissau, Africa.\n\n“In its current form, and based on publicly available information, the trial is inconsistent with established ethical and scientific principles,” the WHO concluded, after providing a bullet-point list of reasons the trial was harmful and low quality.\n\nThe trial has drawn widespread condemnation from health experts since notice of the US funding was published in the Federal Register in December. The notice revealed that the Centers for Disease Control and Prevention—under anti-vaccine Health Secretary Robert F. Kennedy Jr.—had awarded $1.6 million to Danish researchers for their non-competitive, unsolicited proposal to conduct the trial.\n\nThe Danish researchers are led by Christine Stabell Benn and her husband Peter Aaby of the Bandim Health Project, which is based at the University of Southern Denmark in Copenhagen. Benn and her colleagues have long been controversial for their questionable practices in research into alleged vaccine safety concerns. Kennedy has cited their work in his decision to cut global vaccine funding.\n\nThe CDC’s funding of Benn’s hepatitis B vaccine trial also came soon after the agency’s advisors—who were handpicked by Kennedy—decided to abandon a long-standing universal recommendation for a hepatitis B vaccine birth dose. The move was widely decried by health experts.\n\nIn the Guinea-Bissau trial, Benn’s team intended to randomize 14,000 newborns to receive their first dose of hepatitis B vaccine at either birth or at six weeks, and then study differences in alleged safety outcomes. Currently, Guinea-Bissau gives the first vaccine dose at the six-week point, but has already decided to transition to recommend a birth dose in 2028. The reason for the delayed implementation is resource constraints.",
    "summary": "The World Health Organization on Friday released a formal statement blasting a US-funded vaccine trial as “unethical,” because it would withhold an established, safe, and potentially lifesaving vaccine against hepatitis B from some newborns in Guinea-Bissau, Africa.\n\n“In its current form, and based on publicly available information, the trial is inconsistent with established ethical and scientific principles,” the WHO concluded, after providing a bullet-point list of reasons the trial was harmfu..."
  },
  {
    "title": "Merz urges Germans to work more, cites Greece as model",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "Friedrich Merz has called on Germans to work harder and longer hours, arguing that limited working time and high sick leave are weighing on economic growth as Germany’s economy remains stagnant.\n\n“Don’t be lazy,” Merz told the public in a blunt appeal that has opened a risky political confrontation with Germany’s roughly 46 million-strong workforce. In recent weeks, he has repeatedly argued that Germans do not work enough hours and take too much sick leave, slowing the country’s economic performance.\n\nSpeaking to industry representatives in eastern Germany, Merz said national productivity is not high enough and singled out part-time work as a problem. He warned that work-life balance and four-day workweek models would not be enough to preserve the country’s current level of prosperity. “We need to work harder,” he said.\n\nAccording to Politico, the message may be politically sensitive in a year with key regional elections, even in a country where diligence and hard work are often seen as civic virtues.\n\nPointing to Greece\n\nMerz has also pointed to Greece as an example on working hours. Greece ranks at the top in the European Union for the most hours worked, despite having been labeled “lazy” by many German conservatives during the European debt crisis more than a decade ago.\n\nDuring a visit by Greek Prime Minister Kyriakos Mitsotakis to Berlin last year, Merz praised labor market deregulation in Athens that allowed a six-day workweek. He said Germans who consider a 40-hour week unreasonable should “take a look at Greece,” adding that Germany could learn from the country in this area. He acknowledged, however, that German labor productivity remains much higher.\n\nLimited Room to Act\n\nMerz faces strong domestic resistance to labor changes and leads a coalition with the center-left Social Democratic Party of Germany, which supports existing labor protections. That leaves him with limited immediate tools to tackle Germany’s long-running skilled labor shortage and weak productivity.\n\nAt the same time, deeper problems may be emerging in the job market. Unemployment in Germany has recently exceeded 3 million, reaching a 12-year high, amid growing job losses in the industrial sector that has long powered the country’s export-driven economy.\n\n“We have already decided on many measures to help the economy,” Merz wrote on X after the data was released. “But it is not enough.”",
    "summary": "Friedrich Merz has called on Germans to work harder and longer hours, arguing that limited working time and high sick leave are weighing on economic growth as Germany’s economy remains stagnant.\n\n“Don’t be lazy,” Merz told the public in a blunt appeal that has opened a risky political confrontation with Germany’s roughly 46 million-strong workforce. In recent weeks, he has repeatedly argued that Germans do not work enough hours and take too much sick leave, slowing the country’s economic perform..."
  },
  {
    "title": "Trump says change in power in Iran 'would be the best thing that could happen'",
    "score": 1.2,
    "sources": [
      "reddit"
    ],
    "content": "WASHINGTON (AP) — President Donald Trump said Friday that a change in power in Iran “would be the best thing that could happen” as the U.S. administration weighs whether to take military action against Tehran.\n\nTrump made the comments shortly after visiting with troops at Ft. Bragg, North Carolina, and after he confirmed earlier in the day that he’s deploying a second aircraft carrier group to the Mideast.\n\nOther WRAL Top Stories\n\n“It seems like that would be the best thing that could happen,” Trump said in an exchange with reporters when asked about pressing for the ouster of the Islamic clerical rule in Iran. “For 47 years, they’ve been talking and talking and talking.”\n\nThe president has suggested in recent weeks that his top priority is for Iran to further scale back its nuclear program, but on Friday he suggested that's only one aspect of concessions the U.S. needs Iran to make.\n\nIsraeli Prime Minister Benjamin Netanyahu, who traveled to Washington this week for talks with Trump, has been pressing for any deal to include steps to neutralize Iran's ballistic missile program and end its funding for proxy groups such as Hamas and Hezbollah.\n\n“If we do it, that would be the least of the mission,” Trump said of targeting Tehran's nuclear program, which suffered significant setbacks in U.S. military strikes last year.\n\nIran has insisted its nuclear program is for peaceful purposes. Before the June war, Iran had been enriching uranium up to 60% purity, a short, technical step away from weapons-grade levels.\n\nTrump’s comments advocating for a potential end to Ayatollah Ali Khamenei’s rule come just weeks after Secretary of State Marco Rubio said a potential change in power in Iran would be “far more complex” than the administration’s recent effort to oust Venezuelan President Nicolás Maduro from power.\n\nRubio, during a Senate hearing last month, noted that with Iran “you’re talking about a regime that’s in place for a very long time.”\n\n“So that’s going to require a lot of careful thinking, if that eventuality ever presents itself,” Rubio said.\n\nTrump said the USS Gerald R. Ford, the world's largest aircraft carrier, is being sent from the Caribbean Sea to the Mideast to join other warships and military assets the U.S. has built up in the region.\n\nTrump had suggested another round of talks with the Iranians was planned for this week, but those negotiations didn’t materialize as one of Tehran's top security officials visited Oman and Qatar and exchanged messages with U.S. intermediaries.\n\n“In case we don’t make a deal, we’ll need it,” Trump told reporters about the second carrier. He added, “It’ll be leaving very soon.”\n\nAlready, Gulf Arab nations have warned any attack could spiral into another regional conflict in a Mideast still reeling from the Israel-Hamas war in the Gaza Strip. Meanwhile, Iranians are beginning to hold 40-day mourning ceremonies for the thousands killed in Tehran's bloody crackdown on nationwide protests last month, adding to the internal pressure faced by the sanctions-battered Islamic Republic.\n\nThe Ford, whose new deployment was first reported by The New York Times, will join the USS Abraham Lincoln and its accompanying guided-missile destroyers, which have been in the region for over two weeks. U.S. forces already have shot down an Iranian drone that approached the Lincoln on the same day last week that Iran tried to stop a U.S.-flagged ship in the Strait of Hormuz.\n\nTrump in exchanges with reporters on Friday still offered measured hope that a deal can be struck with Iran.\n\n“Give us the deal that they should have given us the first time,\" Trump said about how U.S. military action can be avoided. \"If they give us the right deal, we won’t do that.”\n\nFord had been part of Venezuela strike force\n\nIt would be a quick turnaround for the Ford, which Trump sent from the Mediterranean Sea to the Caribbean last October as the administration built up a huge military presence in the lead-up to the surprise raid last month that captured Maduro.\n\nIt also appears to be at odds with the Trump administration’s national security and defense strategies, which put an emphasis on the Western Hemisphere over other parts of the world.\n\nIn response to questions about the movement of the Ford, U.S. Southern Command said U.S. forces in Latin America will continue to \"counter illicit activities and malign actors in the Western Hemisphere.”\n\n“While force posture evolves, our operational capability does not,” Col. Emanuel Ortiz, spokesperson for Southern Command, said in a statement. U.S. “forces remain fully ready to project power, defend themselves, and protect U.S. interests in the region.”\n\nThe Ford strike group will bring more than 5,000 additional troops to the Middle East but few capabilities or weapons that don't already exist within the Lincoln group. Having two carriers will double the number of aircraft and munitions that are available to military planners and Trump.\n\nGiven the Ford’s current position in the Caribbean, it will likely be weeks before it is off the coast of Iran.\n\nTrump has repeatedly threatened to use force to compel Iran to agree to constrain its nuclear program and earlier over Tehran’s bloody crackdown on nationwide protests.\n\nIran and the United States held indirect talks in Oman a week ago, and Trump later warned Tehran that failure to reach an agreement with his administration would be “very traumatic.” Similar talks last year ultimately broke down in June as Israel launched what became a 12-day war on Iran that included the U.S. bombing Iranian nuclear sites.\n\nLong carrier deployments affect crews and ships\n\nThe USS Ford, meanwhile, first set sail in late June 2025, which means the crew will soon have been deployed for eight months. While it is unclear how long the ship will remain in the Middle East, the move sets the crew up for an unusually long deployment.\n\nThe Navy’s top officer, Adm. Daryl Caudle, told reporters last month that keeping the Ford longer at sea would be “highly disruptive” and that he was “a big non-fan of extensions.”\n\nCarriers are typically deployed for six or seven months. “When it goes past that, that disrupts lives, it disrupts things ... funerals that were planned, marriages that were planned, babies that were planned,” Caudle said.\n\nHe said extending the Ford would complicate its maintenance and upkeep by throwing off the schedule of repairs, adding more wear and tear, and increasing the equipment that will need attention.\n\nFor comparison, the aircraft carrier USS Dwight D. Eisenhower had a nine-month deployment to the Middle East in 2023 and 2024, when it spent much of its time engaged with the Iran-backed Houthi rebels in Yemen. The ship entered maintenance in early 2025 as scheduled, but it blew past its planned completion date of July and remains in the shipyard to this day.\n\nCaudle told The Associated Press in a recent interview that his vision is to deploy smaller, newer ships when possible instead of consistently turning to huge aircraft carriers.\n\n___\n\nMadhani reported from West Palm Beach, Fla., and Gambrell reported from Dubai, United Arab Emirates. Associated Press writer Josh Boak in Washington contributed to this report.",
    "summary": "WASHINGTON (AP) — President Donald Trump said Friday that a change in power in Iran “would be the best thing that could happen” as the U.S. administration weighs whether to take military action against Tehran.\n\nTrump made the comments shortly after visiting with troops at Ft. Bragg, North Carolina, and after he confirmed earlier in the day that he’s deploying a second aircraft carrier group to the Mideast.\n\nOther WRAL Top Stories\n\n“It seems like that would be the best thing that could happen,” T..."
  }
]